In [1]:
import pandas as pd
import sys
import os

src_path = os.path.normpath(os.path.join(os.getcwd(), '..', 'src'))
if src_path not in sys.path:
    sys.path.append(src_path)

from utils.dataset import gather_data

In [2]:
new_names = ["name", "gender", "number"]

datasets = [
    {
        "filename":"../data/most_popular_baby_names_by_sex_and_mother_s_ethnic_group_new_york_city.csv",
        "name_col":"nm",
        "gender_col":"gndr",
        "count_col":"cnt",
        "new_names": new_names
    },
    {
        "filename":"../data/babyNamesUSYOB-full.csv",
        "name_col":"Name",
        "gender_col":"Sex",
        "count_col":"Number",
        "new_names": new_names
    }
]

In [3]:
dfs = [ gather_data(**d)  for d in datasets ]
df = pd.concat(dfs, axis=0)

In [4]:
df.head()

        name gender  number
773   Jayden      M    2925
541    Ethan      M    2809
718    Jacob      M    2663
409   Daniel      M    2417
1470  Sophia      F    2357

In [5]:
df = (df
      .groupby(["name", "gender"])
      .agg({ "number": "sum" })
      .reset_index()
      .sort_values(by="number", ascending=False))

df.head()

          name gender   number
42042    James      M  5122407
46750     John      M  5096818
81467   Robert      M  4803587
68566  Michael      M  4326215
66312     Mary      F  4118147

In [6]:
df["gender"].value_counts()

gender
F    65658
M    39729
Name: count, dtype: int64

In [7]:
df.to_csv("../datasets/names.csv")